## Essential Pandas

1. Intro to Pandas
2. Understanding Series and DataFrames
3. Load CSV, JSON
4. Connecting with Database
5. Data Overview Utilities
6. Accessing a DataFrame
    - Accessing and updating column names
    - Accessing and updating index names
    - Accessing columns by columns names
    - Accessing rows with index values
    - Filter by conditions
7. Handling Missing Values
    - Dropping rows
    - Dropping columns
    - Filling in missing values
8. Handling Duplicates
9. Useful Series Functions
    - map
    - apply
10. Aggregation Operations
    - Group by operations
    - Rolling operations
11. String Operations
12. Append, Merge, and Concatenate

### 1. Intro to Pandas

- High performance open source library for data analytics
- Creates tabular format of data from different sources like csv, json, database
- Have utilities for descriptive statistics, aggregation, handling missing data
- Have database utilities such as merge, join

In [1]:
import pandas as pd
import numpy as np

### 2. Understanding Series and DataFrames

- Series represents a one-dim arrary or one column

In [2]:
ser1 = pd.Series(data=[1,2,3,4], index=list('abcd'))
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
ser2 = pd.Series(data=np.zeros(4), index=list('abcd'))
ser2

a    0.0
b    0.0
c    0.0
d    0.0
dtype: float64

In [4]:
df = pd.DataFrame({'A':ser1,'B':ser2})
df

   A    B
a  1  0.0
b  2  0.0
c  3  0.0
d  4  0.0

In [5]:
df = pd.DataFrame({'A':[1,2,3],'B':[4,5,6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [6]:
print(type(df['A']))
df['A']

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
Name: A, dtype: int64

In [7]:
# create a 10x10 dataframe with random values
df = pd.DataFrame(data=np.random.randint(1,11,(10,10)),columns=list('ABCDEFGHIJ'))
df

    A   B   C   D  E   F  G   H   I   J
0   9   9   3  10  9   2  4   4  10   7
1   5   4   2   9  7   1  9   8   7   9
2   6   1   8   8  2   5  9   7   2   2
3   1   7   2  10  7   1  2  10   5   5
4   8   9  10   7  1   6  3   7   4   9
5   5   7   5   3  4   9  1   2   8   4
6   6   2   2   2  1   5  1   7   4   6
7   5   4   1   1  7  10  9   1   6   9
8   5  10   6   4  3   4  4   7   3   6
9  10   5   2   1  4   1  7   7   6  10

### 3. Load CSV, JSON

In [8]:
df = pd.read_csv("./data/iris.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   class         150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [9]:
df = pd.read_json('./data/iris.json')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   sepalLength  150 non-null    float64
 1   sepalWidth   150 non-null    float64
 2   petalLength  150 non-null    float64
 3   petalWidth   150 non-null    float64
 4   species      150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

### 4. Connecting with Database

May vary for different databases.

In [10]:
# query = "<INSERT SOME SQL QUERY>"
# con = "<Database connection instance>"
# df = pd.read_sql_query(query,con)

### 5. Data Overview Utilities

- head
- tail
- info
- descripe
- value_counts

In [11]:
df = pd.read_csv("./data/iris.csv")

In [12]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [13]:
df.tail(3)

     sepal_length  sepal_width  petal_length  petal_width           class
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   class         150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [15]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [16]:
df['class'].value_counts()

Iris-versicolor    50
Iris-setosa        50
Iris-virginica     50
Name: class, dtype: int64

### 6. Accessing a DataFrame

#### 6.1 Accessing and updating column names

In [17]:
df.columns.values

array(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'class'], dtype=object)

In [18]:
df.rename(columns={'class':'flower_class'},inplace=True)
df.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'flower_class'],
      dtype='object')

#### 6.2 Accessing and updating index names

In [19]:
df.index.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149])

In [20]:
df.index = pd.Series(df.index.values).apply(lambda x: f"flower_{x}")

In [21]:
df.index.values[:5]

array(['flower_0', 'flower_1', 'flower_2', 'flower_3', 'flower_4'],
      dtype=object)

#### 6.3  Accessing columns by columns names

In [22]:
df[['sepal_length', 'sepal_width']].head()

          sepal_length  sepal_width
flower_0           5.1          3.5
flower_1           4.9          3.0
flower_2           4.7          3.2
flower_3           4.6          3.1
flower_4           5.0          3.6

In [23]:
df['sepal_length'][:5]

flower_0    5.1
flower_1    4.9
flower_2    4.7
flower_3    4.6
flower_4    5.0
Name: sepal_length, dtype: float64

#### 6.4 Accessing rows with index values

In [24]:
df.loc['flower_0']

sepal_length            5.1
sepal_width             3.5
petal_length            1.4
petal_width             0.2
flower_class    Iris-setosa
Name: flower_0, dtype: object

In [25]:
df.loc['flower_0':'flower_5',['sepal_length','sepal_width']]

          sepal_length  sepal_width
flower_0           5.1          3.5
flower_1           4.9          3.0
flower_2           4.7          3.2
flower_3           4.6          3.1
flower_4           5.0          3.6
flower_5           5.4          3.9

In [26]:
df.iloc[0]

sepal_length            5.1
sepal_width             3.5
petal_length            1.4
petal_width             0.2
flower_class    Iris-setosa
Name: flower_0, dtype: object

In [27]:
df.iloc[0:5]

          sepal_length  sepal_width  petal_length  petal_width flower_class
flower_0           5.1          3.5           1.4          0.2  Iris-setosa
flower_1           4.9          3.0           1.4          0.2  Iris-setosa
flower_2           4.7          3.2           1.3          0.2  Iris-setosa
flower_3           4.6          3.1           1.5          0.2  Iris-setosa
flower_4           5.0          3.6           1.4          0.2  Iris-setosa

#### 6.5 Filter by conditions

In [28]:
df[df['sepal_length']>7]

,sepal_length,sepal_width,petal_length,petal_width,flower_class
flower_102,7.1,3.0,5.9,2.1,Iris-virginica
flower_105,7.6,3.0,6.6,2.1,Iris-virginica
flower_107,7.3,2.9,6.3,1.8,Iris-virginica
flower_109,7.2,3.6,6.1,2.5,Iris-virginica
flower_117,7.7,3.8,6.7,2.2,Iris-virginica
flower_118,7.7,2.6,6.9,2.3,Iris-virginica
flower_122,7.7,2.8,6.7,2.0,Iris-virginica
flower_125,7.2,3.2,6.0,1.8,Iris-virginica
flower_129,7.2,3.0,5.8,1.6,Iris-virginica
flower_130,7.4,2.8,6.1,1.9,Iris-virginica
flower_131,7.9,3.8,6.4,2.0,Iris-virginica
flower_135,7.7,3.0,6.1,2.3,Iris-virginica

In [29]:
df.loc[df['sepal_length']>7, 'flower_class']

flower_102    Iris-virginica
flower_105    Iris-virginica
flower_107    Iris-virginica
flower_109    Iris-virginica
flower_117    Iris-virginica
flower_118    Iris-virginica
flower_122    Iris-virginica
flower_125    Iris-virginica
flower_129    Iris-virginica
flower_130    Iris-virginica
flower_131    Iris-virginica
flower_135    Iris-virginica
Name: flower_class, dtype: object

### 7. Handling Missing Data

Machine learning algorithms often do not expect missing data.

Some general guidlines:
- Drop columns with >40% missing data
- Drop rows with missing data for important columns

In [30]:
df = pd.read_csv("./data/iris_missing.csv")

In [31]:
df.isna().mean()

sepal_length    0.040000
sepal_width     0.000000
petal_length    0.566667
petal_width     0.026667
class           0.020000
dtype: float64

#### 7.1 Dropping rows

In [32]:
# class the output variable, drop rows which are missing it
df.dropna(subset=['class'], inplace=False).head(1)

   sepal_length  sepal_width  petal_length  petal_width        class
0           5.1          3.5           1.4          0.2  Iris-setosa

#### 7.2 Dropping Columns

In [33]:
df.drop(['petal_length'],axis=1,inplace=True)

#### 7.3 Filling in Missing Values

In [34]:
df.fillna({'sepal_length':df['sepal_length'].median(),
          'petal_width':df['petal_width'].median(),
          'class':'unknown'},inplace=True)

In [35]:
df.isna().mean()

sepal_length    0.0
sepal_width     0.0
petal_width     0.0
class           0.0
dtype: float64

### 8. Handling Duplicates

- Somtimes you do not wish to have duplicates in a column or in your data

In [36]:
# rows with duplicated values
df[df.duplicated()].head()

     sepal_length  sepal_width  petal_width            class
16            5.4          3.9          0.4      Iris-setosa
24            4.8          3.4          0.2      Iris-setosa
37            4.9          3.1          0.1      Iris-setosa
99            5.7          2.8          1.3  Iris-versicolor
142           5.8          2.7          1.9   Iris-virginica

In [37]:
df[df.duplicated(subset=['sepal_length','sepal_width'])].head()

    sepal_length  sepal_width  petal_width        class
16           5.4          3.9          0.4  Iris-setosa
17           5.1          3.5          0.3  Iris-setosa
24           4.8          3.4          0.2  Iris-setosa
26           5.0          3.4          0.4  Iris-setosa
31           5.4          3.4          0.4  Iris-setosa

In [38]:
# drop duplicated rows
df.drop_duplicates().reset_index(drop=True).head()

   sepal_length  sepal_width  petal_width        class
0           5.1          3.5          0.2  Iris-setosa
1           4.9          3.0          0.2  Iris-setosa
2           4.7          3.2          0.2  Iris-setosa
3           4.6          3.1          0.2  Iris-setosa
4           5.0          3.6          0.2  Iris-setosa

### 9. Useful Series Functions

- map
    - conditional mapping
    - dictionary 1-to-1 mapping
- apply
    - lambda function

In [39]:
df['petal_size'] = df['petal_width'].map(lambda x: 'big' if x>1.3 else 'small')

In [40]:
df.head()

   sepal_length  sepal_width  petal_width        class petal_size
0           5.1          3.5          0.2  Iris-setosa      small
1           4.9          3.0          0.2  Iris-setosa      small
2           4.7          3.2          0.2  Iris-setosa      small
3           4.6          3.1          0.2  Iris-setosa      small
4           5.0          3.6          0.2  Iris-setosa      small

In [41]:
df['class'].unique()

array(['Iris-setosa', 'unknown', 'Iris-versicolor', 'Iris-virginica'],
      dtype=object)

In [42]:
class_dict = {'Iris-setosa':'setosa', 'unknown':'unknown', 
              'Iris-versicolor':'versicolor', 'Iris-virginica':'virginica'}
df['class'] = df['class'].map(class_dict)

In [43]:
df.head()

   sepal_length  sepal_width  petal_width   class petal_size
0           5.1          3.5          0.2  setosa      small
1           4.9          3.0          0.2  setosa      small
2           4.7          3.2          0.2  setosa      small
3           4.6          3.1          0.2  setosa      small
4           5.0          3.6          0.2  setosa      small

In [44]:
df['petal_size'] = df['petal_size'].apply(lambda x: f"{x}_petal")

In [45]:
df.head()

   sepal_length  sepal_width  petal_width   class   petal_size
0           5.1          3.5          0.2  setosa  small_petal
1           4.9          3.0          0.2  setosa  small_petal
2           4.7          3.2          0.2  setosa  small_petal
3           4.6          3.1          0.2  setosa  small_petal
4           5.0          3.6          0.2  setosa  small_petal

### 10. Aggregation Operations

#### 10.1 Group By Operations

In [46]:
df.groupby(['class'])['sepal_length'].mean()

class
setosa        5.085714
unknown       5.166667
versicolor    5.948980
virginica     6.622449
Name: sepal_length, dtype: float64

In [47]:
df.groupby(['class'])['sepal_length'].agg(['mean','median','std','min','max'])

                mean  median       std  min  max
class
setosa      5.085714     5.1  0.408758  4.3  5.8
unknown     5.166667     5.1  0.305505  4.9  5.5
versicolor  5.948980     5.9  0.515640  4.9  7.0
virginica   6.622449     6.5  0.593459  5.6  7.9

#### 10.2 Rolling Operations

In [48]:
df['sepal_length'].rolling(window=5,min_periods=1).agg(['mean','median']).head()

    mean  median
0  5.100     5.1
1  5.000     5.0
2  4.900     4.9
3  4.825     4.8
4  4.860     4.9

### 11. String Operations

In [49]:
df['class'][df['class'].str.contains('sa')].head()

0    setosa
1    setosa
2    setosa
3    setosa
4    setosa
Name: class, dtype: object

In [50]:
df['class'].str.replace('s','S').head()

0    SetoSa
1    SetoSa
2    SetoSa
3    SetoSa
4    SetoSa
Name: class, dtype: object

In [51]:
df['class'].str.split('o').head()

0    [set, sa]
1    [set, sa]
2    [set, sa]
3    [set, sa]
4    [set, sa]
Name: class, dtype: object

### 12. Merge, and Concatenate

#### 12.1 Merge

In [52]:
left = pd.DataFrame({'key':[0,1,2,3,4,5,6],
                    'A':np.random.randint(1,11,7)})
right = pd.DataFrame({'key':[0,1,2,3,4,5,7],
                    'B':np.random.randint(1,11,7)})

In [53]:
left.merge(right,on='key')

   key   A  B
0    0   3  6
1    1   3  1
2    2   5  5
3    3   7  4
4    4   4  8
5    5  10  8

In [54]:
left.merge(right,on='key',how='left')

   key   A    B
0    0   3  6.0
1    1   3  1.0
2    2   5  5.0
3    3   7  4.0
4    4   4  8.0
5    5  10  8.0
6    6   8  NaN

In [55]:
left.merge(right,on='key',how='right')

   key     A  B
0    0   3.0  6
1    1   3.0  1
2    2   5.0  5
3    3   7.0  4
4    4   4.0  8
5    5  10.0  8
6    7   NaN  4

In [56]:
left.merge(right,on='key',how='outer')

   key     A    B
0    0   3.0  6.0
1    1   3.0  1.0
2    2   5.0  5.0
3    3   7.0  4.0
4    4   4.0  8.0
5    5  10.0  8.0
6    6   8.0  NaN
7    7   NaN  4.0

#### 12.2 Concatenate

In [57]:
pd.concat([left,right], axis=0, join='inner', ignore_index=True)

    key
0     0
1     1
2     2
3     3
4     4
5     5
6     6
7     0
8     1
9     2
10    3
11    4
12    5
13    7

In [58]:
pd.concat([left,right], axis=0, join='outer', ignore_index=True, sort=False)

    key     A    B
0     0   3.0  NaN
1     1   3.0  NaN
2     2   5.0  NaN
3     3   7.0  NaN
4     4   4.0  NaN
5     5  10.0  NaN
6     6   8.0  NaN
7     0   NaN  6.0
8     1   NaN  1.0
9     2   NaN  5.0
10    3   NaN  4.0
11    4   NaN  8.0
12    5   NaN  8.0
13    7   NaN  4.0

In [59]:
pd.concat([left,right], axis=1, join='inner')

   key   A  key  B
0    0   3    0  6
1    1   3    1  1
2    2   5    2  5
3    3   7    3  4
4    4   4    4  8
5    5  10    5  8
6    6   8    7  4

In [60]:
left.index = ['a','b','c','d','e','f','g']

In [61]:
pd.concat([left,right], axis=1, join='outer')

   key     A  key    B
a  0.0   3.0  NaN  NaN
b  1.0   3.0  NaN  NaN
c  2.0   5.0  NaN  NaN
d  3.0   7.0  NaN  NaN
e  4.0   4.0  NaN  NaN
f  5.0  10.0  NaN  NaN
g  6.0   8.0  NaN  NaN
0  NaN   NaN  0.0  6.0
1  NaN   NaN  1.0  1.0
2  NaN   NaN  2.0  5.0
3  NaN   NaN  3.0  4.0
4  NaN   NaN  4.0  8.0
5  NaN   NaN  5.0  8.0
6  NaN   NaN  7.0  4.0

### 13. Pivot Table

In [62]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [63]:
pd.pivot_table(df, values='D', index=['A'],
                    columns=['C'], aggfunc=np.sum)

C    large  small
A
bar     11     11
foo      4      7

In [64]:
pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
                    aggfunc={'D': np.mean,
                             'E': [min, max, np.mean]})

                  D    E
               mean  max      mean  min
A   C
bar large  5.500000  9.0  7.500000  6.0
    small  5.500000  9.0  8.500000  8.0
foo large  2.000000  5.0  4.500000  4.0
    small  2.333333  6.0  4.333333  2.0

### 14. Json Normalization

In [65]:
data = [{'id': 1, 'name': {'first': 'Coleen', 'last': 'Volk'}},
        {'name': {'given': 'Mose', 'family': 'Regner'}},
        {'id': 2, 'name': 'Faye Raker'}]

In [66]:
pd.json_normalize(data)

    id name.first name.last name.given name.family        name
0  1.0     Coleen      Volk        NaN         NaN         NaN
1  NaN        NaN       NaN       Mose      Regner         NaN
2  2.0        NaN       NaN        NaN         NaN  Faye Raker